app/controllers/movies_controller.rb

  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "movies" SET "total_gross" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["total_gross", #<BigDecimal:7fd076b06578,'0.62335791E9',9(27)>], ["updated_at", 2016-06-07 20:39:33 UTC], ["id", 7]]

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("title", "rating", "total_gross", "created_at", "updated_at", "description", "released_on", "cast", "director", "duration", "image_file_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)