app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("name", "stars", "comment", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@review = @movie.reviews.new(review_params)
		if @review.save